lib/tasks/dev.rake

INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Friend"], ["created_at", "2020-07-25 00:59:07.696874"], ["updated_at", "2020-07-25 00:59:07.696874"]]
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at", "kind_id") VALUES (?, ?, ?, ?, ?, ?)
SELECT "kinds".* FROM "kinds"
SELECT "contacts".* FROM "contacts"
INSERT INTO "phones" ("number", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", "493-786-6556"], ["contact_id", 2], ["created_at", "2020-07-25 00:59:08.845681"], ["updated_at", "2020-07-25 00:59:08.845681"]]
---
  task setup: :environment do
    %x(rails db:drop db:create db:migrate)

    kinds = %w(Friend Comercial Colegue)

    kinds.each do |kind|
      Kind.create!(
        description: kind
      )
    end

    100.times do |i|
      Contact.create!(
        name: Faker::Name.name,
        email: Faker::Internet.email,
        birthdate: Faker::Date.between(:from => 65.years.ago, :to => 18.years.ago),
        kind: Kind.all.sample
      )
    end

    Contact.all.each do |contact|
      Random.rand(5).times do |i|
        phone = Phone.create!(
          number: Faker::PhoneNumber.cell_phone,
          contact: contact
        )

INSERT INTO "addresses" ("street", "city", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["street", "Claud Trail"], ["city", "West Rodgertown"], ["contact_id", 1], ["created_at", "2020-07-25 00:59:08.837996"], ["updated_at", "2020-07-25 00:59:08.837996"]]
---
        contact.save!
      end

      Address.create!(
        street: Faker::Address.street_name,
        city: Faker::Address.city,
        contact: contact
      )