app/controllers/contacts_controller.rb

  def index
    kind_id = params[:kind_id]

    @contacts = kind_id ? Contact.where(kind: kind_id) : Contact.all
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."kind_id" = ?  [["kind_id", 1]]