app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at", "kind_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "name teste"], ["email", "name.teste@gmail.com"], ["birthdate", "1995-10-02"], ["created_at", "2020-08-06 03:42:13.678101"], ["updated_at", "2020-08-06 03:42:13.678101"], ["kind_id", 1]]

  def update
    if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = ?, "email" = ?, "birthdate" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "name teste atualizado"], ["email", "name.teste.atualizado@gmail.com"], ["birthdate", "1995-11-12"], ["updated_at", "2020-08-06 03:45:20.594985"], ["id", 102]]