app/controllers/phones_controller.rb

        def set_phones
            if params[:contact_id]
                @phones = Contact.find(params[:contact_id]).phones
---
SELECT "phones".* FROM "phones" WHERE "phones"."contact_id" = ?  [["contact_id", 2]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]